Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/**
 * \brief Component description for MPDDRC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_MPDDRC_COMPONENT_H_
#define _SAM9X_MPDDRC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MPDDRC                                       */
/* ************************************************************************** */

/* -------- MPDDRC_MR : (MPDDRC Offset: 0x00) (R/W 32) Mode Register -------- */
#define MPDDRC_MR_MODE_Pos                    _U_(0)                                               /**< (MPDDRC_MR) MPDDRC Command Mode Position */
#define MPDDRC_MR_MODE_Msk                    (_U_(0x7) << MPDDRC_MR_MODE_Pos)                     /**< (MPDDRC_MR) MPDDRC Command Mode Mask */
#define MPDDRC_MR_MODE(value)                 (MPDDRC_MR_MODE_Msk & ((value) << MPDDRC_MR_MODE_Pos))
#define   MPDDRC_MR_MODE_NORMAL_CMD_Val       _U_(0x0)                                             /**< (MPDDRC_MR) Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_NOP_CMD_Val          _U_(0x1)                                             /**< (MPDDRC_MR) The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_PRCGALL_CMD_Val      _U_(0x2)                                             /**< (MPDDRC_MR) The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   MPDDRC_MR_MODE_LMR_CMD_Val          _U_(0x3)                                             /**< (MPDDRC_MR) The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_RFSH_CMD_Val         _U_(0x4)                                             /**< (MPDDRC_MR) The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_EXT_LMR_CMD_Val      _U_(0x5)                                             /**< (MPDDRC_MR) The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank.  */
#define   MPDDRC_MR_MODE_DEEP_MD_Val          _U_(0x6)                                             /**< (MPDDRC_MR) Deep Power mode: Access to Deep Powerdown mode  */
#define MPDDRC_MR_MODE_NORMAL_CMD             (MPDDRC_MR_MODE_NORMAL_CMD_Val << MPDDRC_MR_MODE_Pos) /**< (MPDDRC_MR) Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_NOP_CMD                (MPDDRC_MR_MODE_NOP_CMD_Val << MPDDRC_MR_MODE_Pos)   /**< (MPDDRC_MR) The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_PRCGALL_CMD            (MPDDRC_MR_MODE_PRCGALL_CMD_Val << MPDDRC_MR_MODE_Pos) /**< (MPDDRC_MR) The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define MPDDRC_MR_MODE_LMR_CMD                (MPDDRC_MR_MODE_LMR_CMD_Val << MPDDRC_MR_MODE_Pos)   /**< (MPDDRC_MR) The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_RFSH_CMD               (MPDDRC_MR_MODE_RFSH_CMD_Val << MPDDRC_MR_MODE_Pos)  /**< (MPDDRC_MR) The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_EXT_LMR_CMD            (MPDDRC_MR_MODE_EXT_LMR_CMD_Val << MPDDRC_MR_MODE_Pos) /**< (MPDDRC_MR) The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank. Position  */
#define MPDDRC_MR_MODE_DEEP_MD                (MPDDRC_MR_MODE_DEEP_MD_Val << MPDDRC_MR_MODE_Pos)   /**< (MPDDRC_MR) Deep Power mode: Access to Deep Powerdown mode Position  */
#define MPDDRC_MR_Msk                         _U_(0x00000007)                                      /**< (MPDDRC_MR) Register Mask  */


/* -------- MPDDRC_RTR : (MPDDRC Offset: 0x04) (R/W 32) Refresh Timer Register -------- */
#define MPDDRC_RTR_COUNT_Pos                  _U_(0)                                               /**< (MPDDRC_RTR) MPDDRC Refresh Timer Count Position */
#define MPDDRC_RTR_COUNT_Msk                  (_U_(0xFFF) << MPDDRC_RTR_COUNT_Pos)                 /**< (MPDDRC_RTR) MPDDRC Refresh Timer Count Mask */
#define MPDDRC_RTR_COUNT(value)               (MPDDRC_RTR_COUNT_Msk & ((value) << MPDDRC_RTR_COUNT_Pos))
#define MPDDRC_RTR_Msk                        _U_(0x00000FFF)                                      /**< (MPDDRC_RTR) Register Mask  */


/* -------- MPDDRC_CR : (MPDDRC Offset: 0x08) (R/W 32) Configuration Register -------- */
#define MPDDRC_CR_NC_Pos                      _U_(0)                                               /**< (MPDDRC_CR) Number of Column Bits Position */
#define MPDDRC_CR_NC_Msk                      (_U_(0x3) << MPDDRC_CR_NC_Pos)                       /**< (MPDDRC_CR) Number of Column Bits Mask */
#define MPDDRC_CR_NC(value)                   (MPDDRC_CR_NC_Msk & ((value) << MPDDRC_CR_NC_Pos))  
#define   MPDDRC_CR_NC_9_COL_BITS_Val         _U_(0x0)                                             /**< (MPDDRC_CR) 9 bits to define the column number, up to 512 columns  */
#define   MPDDRC_CR_NC_10_COL_BITS_Val        _U_(0x1)                                             /**< (MPDDRC_CR) 10 bits to define the column number, up to 1024 columns  */
#define   MPDDRC_CR_NC_11_COL_BITS_Val        _U_(0x2)                                             /**< (MPDDRC_CR) 11 bits to define the column number, up to 2048 columns  */
#define   MPDDRC_CR_NC_12_COL_BITS_Val        _U_(0x3)                                             /**< (MPDDRC_CR) 12 bits to define the column number, up to 4096 columns  */
#define MPDDRC_CR_NC_9_COL_BITS               (MPDDRC_CR_NC_9_COL_BITS_Val << MPDDRC_CR_NC_Pos)    /**< (MPDDRC_CR) 9 bits to define the column number, up to 512 columns Position  */
#define MPDDRC_CR_NC_10_COL_BITS              (MPDDRC_CR_NC_10_COL_BITS_Val << MPDDRC_CR_NC_Pos)   /**< (MPDDRC_CR) 10 bits to define the column number, up to 1024 columns Position  */
#define MPDDRC_CR_NC_11_COL_BITS              (MPDDRC_CR_NC_11_COL_BITS_Val << MPDDRC_CR_NC_Pos)   /**< (MPDDRC_CR) 11 bits to define the column number, up to 2048 columns Position  */
#define MPDDRC_CR_NC_12_COL_BITS              (MPDDRC_CR_NC_12_COL_BITS_Val << MPDDRC_CR_NC_Pos)   /**< (MPDDRC_CR) 12 bits to define the column number, up to 4096 columns Position  */
#define MPDDRC_CR_NR_Pos                      _U_(2)                                               /**< (MPDDRC_CR) Number of Row Bits. Position */
#define MPDDRC_CR_NR_Msk                      (_U_(0x3) << MPDDRC_CR_NR_Pos)                       /**< (MPDDRC_CR) Number of Row Bits. Mask */
#define MPDDRC_CR_NR(value)                   (MPDDRC_CR_NR_Msk & ((value) << MPDDRC_CR_NR_Pos))  
#define   MPDDRC_CR_NR_11_ROW_BITS_Val        _U_(0x0)                                             /**< (MPDDRC_CR) 11 bits to define the row number, up to 2048 rows  */
#define   MPDDRC_CR_NR_12_ROW_BITS_Val        _U_(0x1)                                             /**< (MPDDRC_CR) 12 bits to define the row number, up to 4096 rows  */
#define   MPDDRC_CR_NR_13_ROW_BITS_Val        _U_(0x2)                                             /**< (MPDDRC_CR) 13 bits to define the row number, up to 8192 rows  */
#define   MPDDRC_CR_NR_14_ROW_BITS_Val        _U_(0x3)                                             /**< (MPDDRC_CR) 14 bits to define the row number, up to 16384 rows  */
#define MPDDRC_CR_NR_11_ROW_BITS              (MPDDRC_CR_NR_11_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 11 bits to define the row number, up to 2048 rows Position  */
#define MPDDRC_CR_NR_12_ROW_BITS              (MPDDRC_CR_NR_12_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 12 bits to define the row number, up to 4096 rows Position  */
#define MPDDRC_CR_NR_13_ROW_BITS              (MPDDRC_CR_NR_13_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 13 bits to define the row number, up to 8192 rows Position  */
#define MPDDRC_CR_NR_14_ROW_BITS              (MPDDRC_CR_NR_14_ROW_BITS_Val << MPDDRC_CR_NR_Pos)   /**< (MPDDRC_CR) 14 bits to define the row number, up to 16384 rows Position  */
#define MPDDRC_CR_CAS_Pos                     _U_(4)                                               /**< (MPDDRC_CR) CAS Latency Position */
#define MPDDRC_CR_CAS_Msk                     (_U_(0x7) << MPDDRC_CR_CAS_Pos)                      /**< (MPDDRC_CR) CAS Latency Mask */
#define MPDDRC_CR_CAS(value)                  (MPDDRC_CR_CAS_Msk & ((value) << MPDDRC_CR_CAS_Pos))
#define   MPDDRC_CR_CAS_DDR_CAS2_Val          _U_(0x2)                                             /**< (MPDDRC_CR) LPDDR1 CAS Latency 2  */
#define   MPDDRC_CR_CAS_DDR_CAS3_Val          _U_(0x3)                                             /**< (MPDDRC_CR) DDR2/LPDDR1 CAS Latency 3  */
#define   MPDDRC_CR_CAS_DDR_CAS4_Val          _U_(0x4)                                             /**< (MPDDRC_CR) DDR2 CAS Latency 4  */
#define MPDDRC_CR_CAS_DDR_CAS2                (MPDDRC_CR_CAS_DDR_CAS2_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) LPDDR1 CAS Latency 2 Position  */
#define MPDDRC_CR_CAS_DDR_CAS3                (MPDDRC_CR_CAS_DDR_CAS3_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) DDR2/LPDDR1 CAS Latency 3 Position  */
#define MPDDRC_CR_CAS_DDR_CAS4                (MPDDRC_CR_CAS_DDR_CAS4_Val << MPDDRC_CR_CAS_Pos)    /**< (MPDDRC_CR) DDR2 CAS Latency 4 Position  */
#define MPDDRC_CR_DLL_Pos                     _U_(7)                                               /**< (MPDDRC_CR) Reset DLL Position */
#define MPDDRC_CR_DLL_Msk                     (_U_(0x1) << MPDDRC_CR_DLL_Pos)                      /**< (MPDDRC_CR) Reset DLL Mask */
#define MPDDRC_CR_DLL(value)                  (MPDDRC_CR_DLL_Msk & ((value) << MPDDRC_CR_DLL_Pos))
#define   MPDDRC_CR_DLL_RESET_DISABLED_Val    _U_(0x0)                                             /**< (MPDDRC_CR) Disable DLL reset  */
#define   MPDDRC_CR_DLL_RESET_ENABLED_Val     _U_(0x1)                                             /**< (MPDDRC_CR) Enable DLL reset  */
#define MPDDRC_CR_DLL_RESET_DISABLED          (MPDDRC_CR_DLL_RESET_DISABLED_Val << MPDDRC_CR_DLL_Pos) /**< (MPDDRC_CR) Disable DLL reset Position  */
#define MPDDRC_CR_DLL_RESET_ENABLED           (MPDDRC_CR_DLL_RESET_ENABLED_Val << MPDDRC_CR_DLL_Pos) /**< (MPDDRC_CR) Enable DLL reset Position  */
#define MPDDRC_CR_DIC_DS_Pos                  _U_(8)                                               /**< (MPDDRC_CR) Output Driver Impedance Control (Drive Strength) Position */
#define MPDDRC_CR_DIC_DS_Msk                  (_U_(0x1) << MPDDRC_CR_DIC_DS_Pos)                   /**< (MPDDRC_CR) Output Driver Impedance Control (Drive Strength) Mask */
#define MPDDRC_CR_DIC_DS(value)               (MPDDRC_CR_DIC_DS_Msk & ((value) << MPDDRC_CR_DIC_DS_Pos))
#define   MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH_Val _U_(0x0)                                             /**< (MPDDRC_CR) Normal drive strength (DDR2)  */
#define   MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH_Val _U_(0x1)                                             /**< (MPDDRC_CR) Weak drive strength (DDR2)  */
#define MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH  (MPDDRC_CR_DIC_DS_DDR2_NORMALSTRENGTH_Val << MPDDRC_CR_DIC_DS_Pos) /**< (MPDDRC_CR) Normal drive strength (DDR2) Position  */
#define MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH    (MPDDRC_CR_DIC_DS_DDR2_WEAKSTRENGTH_Val << MPDDRC_CR_DIC_DS_Pos) /**< (MPDDRC_CR) Weak drive strength (DDR2) Position  */
#define MPDDRC_CR_DIS_DLL_Pos                 _U_(9)                                               /**< (MPDDRC_CR) DISABLE DLL Position */
#define MPDDRC_CR_DIS_DLL_Msk                 (_U_(0x1) << MPDDRC_CR_DIS_DLL_Pos)                  /**< (MPDDRC_CR) DISABLE DLL Mask */
#define MPDDRC_CR_DIS_DLL(value)              (MPDDRC_CR_DIS_DLL_Msk & ((value) << MPDDRC_CR_DIS_DLL_Pos))
#define MPDDRC_CR_OCD_Pos                     _U_(12)                                              /**< (MPDDRC_CR) Off-chip Driver Position */
#define MPDDRC_CR_OCD_Msk                     (_U_(0x7) << MPDDRC_CR_OCD_Pos)                      /**< (MPDDRC_CR) Off-chip Driver Mask */
#define MPDDRC_CR_OCD(value)                  (MPDDRC_CR_OCD_Msk & ((value) << MPDDRC_CR_OCD_Pos))
#define   MPDDRC_CR_OCD_DDR2_EXITCALIB_Val    _U_(0x0)                                             /**< (MPDDRC_CR) Exit from OCD Calibration mode and maintain settings  */
#define   MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB_Val _U_(0x7)                                             /**< (MPDDRC_CR) OCD calibration default  */
#define MPDDRC_CR_OCD_DDR2_EXITCALIB          (MPDDRC_CR_OCD_DDR2_EXITCALIB_Val << MPDDRC_CR_OCD_Pos) /**< (MPDDRC_CR) Exit from OCD Calibration mode and maintain settings Position  */
#define MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB      (MPDDRC_CR_OCD_DDR2_DEFAULT_CALIB_Val << MPDDRC_CR_OCD_Pos) /**< (MPDDRC_CR) OCD calibration default Position  */
#define MPDDRC_CR_DQMS_Pos                    _U_(16)                                              /**< (MPDDRC_CR) Mask Data is Shared Position */
#define MPDDRC_CR_DQMS_Msk                    (_U_(0x1) << MPDDRC_CR_DQMS_Pos)                     /**< (MPDDRC_CR) Mask Data is Shared Mask */
#define MPDDRC_CR_DQMS(value)                 (MPDDRC_CR_DQMS_Msk & ((value) << MPDDRC_CR_DQMS_Pos))
#define   MPDDRC_CR_DQMS_NOT_SHARED_Val       _U_(0x0)                                             /**< (MPDDRC_CR) DQM is not shared with another controller  */
#define   MPDDRC_CR_DQMS_SHARED_Val           _U_(0x1)                                             /**< (MPDDRC_CR) DQM is shared with another controller  */
#define MPDDRC_CR_DQMS_NOT_SHARED             (MPDDRC_CR_DQMS_NOT_SHARED_Val << MPDDRC_CR_DQMS_Pos) /**< (MPDDRC_CR) DQM is not shared with another controller Position  */
#define MPDDRC_CR_DQMS_SHARED                 (MPDDRC_CR_DQMS_SHARED_Val << MPDDRC_CR_DQMS_Pos)    /**< (MPDDRC_CR) DQM is shared with another controller Position  */
#define MPDDRC_CR_LC_LPDDR1_Pos               _U_(19)                                              /**< (MPDDRC_CR) Low-cost Low-power DDR1 Position */
#define MPDDRC_CR_LC_LPDDR1_Msk               (_U_(0x1) << MPDDRC_CR_LC_LPDDR1_Pos)                /**< (MPDDRC_CR) Low-cost Low-power DDR1 Mask */
#define MPDDRC_CR_LC_LPDDR1(value)            (MPDDRC_CR_LC_LPDDR1_Msk & ((value) << MPDDRC_CR_LC_LPDDR1_Pos))
#define   MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS_Val _U_(0x0)                                             /**< (MPDDRC_CR) Any type of memory devices except of low cost, low density Low Power DDR1.  */
#define   MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1_Val _U_(0x1)                                             /**< (MPDDRC_CR) Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.  */
#define MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS       (MPDDRC_CR_LC_LPDDR1_NOT_2_BANKS_Val << MPDDRC_CR_LC_LPDDR1_Pos) /**< (MPDDRC_CR) Any type of memory devices except of low cost, low density Low Power DDR1. Position  */
#define MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1    (MPDDRC_CR_LC_LPDDR1_2_BANKS_LPDDR1_Val << MPDDRC_CR_LC_LPDDR1_Pos) /**< (MPDDRC_CR) Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows. Position  */
#define MPDDRC_CR_NB_Pos                      _U_(20)                                              /**< (MPDDRC_CR) Number of Banks Position */
#define MPDDRC_CR_NB_Msk                      (_U_(0x1) << MPDDRC_CR_NB_Pos)                       /**< (MPDDRC_CR) Number of Banks Mask */
#define MPDDRC_CR_NB(value)                   (MPDDRC_CR_NB_Msk & ((value) << MPDDRC_CR_NB_Pos))  
#define   MPDDRC_CR_NB_4_BANKS_Val            _U_(0x0)                                             /**< (MPDDRC_CR) 4-bank memory devices  */
#define   MPDDRC_CR_NB_8_BANKS_Val            _U_(0x1)                                             /**< (MPDDRC_CR) 8 banks. Only possible when using DDR2-SDRAM devices.  */
#define MPDDRC_CR_NB_4_BANKS                  (MPDDRC_CR_NB_4_BANKS_Val << MPDDRC_CR_NB_Pos)       /**< (MPDDRC_CR) 4-bank memory devices Position  */
#define MPDDRC_CR_NB_8_BANKS                  (MPDDRC_CR_NB_8_BANKS_Val << MPDDRC_CR_NB_Pos)       /**< (MPDDRC_CR) 8 banks. Only possible when using DDR2-SDRAM devices. Position  */
#define MPDDRC_CR_NDQS_Pos                    _U_(21)                                              /**< (MPDDRC_CR) Not DQS. Position */
#define MPDDRC_CR_NDQS_Msk                    (_U_(0x1) << MPDDRC_CR_NDQS_Pos)                     /**< (MPDDRC_CR) Not DQS. Mask */
#define MPDDRC_CR_NDQS(value)                 (MPDDRC_CR_NDQS_Msk & ((value) << MPDDRC_CR_NDQS_Pos))
#define   MPDDRC_CR_NDQS_ENABLED_Val          _U_(0x0)                                             /**< (MPDDRC_CR) Not DQS is enabled  */
#define   MPDDRC_CR_NDQS_DISABLED_Val         _U_(0x1)                                             /**< (MPDDRC_CR) Not DQS is disabled  */
#define MPDDRC_CR_NDQS_ENABLED                (MPDDRC_CR_NDQS_ENABLED_Val << MPDDRC_CR_NDQS_Pos)   /**< (MPDDRC_CR) Not DQS is enabled Position  */
#define MPDDRC_CR_NDQS_DISABLED               (MPDDRC_CR_NDQS_DISABLED_Val << MPDDRC_CR_NDQS_Pos)  /**< (MPDDRC_CR) Not DQS is disabled Position  */
#define MPDDRC_CR_DECOD_Pos                   _U_(22)                                              /**< (MPDDRC_CR) Type of Decoding Position */
#define MPDDRC_CR_DECOD_Msk                   (_U_(0x1) << MPDDRC_CR_DECOD_Pos)                    /**< (MPDDRC_CR) Type of Decoding Mask */
#define MPDDRC_CR_DECOD(value)                (MPDDRC_CR_DECOD_Msk & ((value) << MPDDRC_CR_DECOD_Pos))
#define   MPDDRC_CR_DECOD_SEQUENTIAL_Val      _U_(0x0)                                             /**< (MPDDRC_CR) Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank.  */
#define   MPDDRC_CR_DECOD_INTERLEAVED_Val     _U_(0x1)                                             /**< (MPDDRC_CR) Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank.  */
#define MPDDRC_CR_DECOD_SEQUENTIAL            (MPDDRC_CR_DECOD_SEQUENTIAL_Val << MPDDRC_CR_DECOD_Pos) /**< (MPDDRC_CR) Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank. Position  */
#define MPDDRC_CR_DECOD_INTERLEAVED           (MPDDRC_CR_DECOD_INTERLEAVED_Val << MPDDRC_CR_DECOD_Pos) /**< (MPDDRC_CR) Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank. Position  */
#define MPDDRC_CR_UNAL_Pos                    _U_(23)                                              /**< (MPDDRC_CR) Support Unaligned Access (masters supporting byte-strobes) Position */
#define MPDDRC_CR_UNAL_Msk                    (_U_(0x1) << MPDDRC_CR_UNAL_Pos)                     /**< (MPDDRC_CR) Support Unaligned Access (masters supporting byte-strobes) Mask */
#define MPDDRC_CR_UNAL(value)                 (MPDDRC_CR_UNAL_Msk & ((value) << MPDDRC_CR_UNAL_Pos))
#define   MPDDRC_CR_UNAL_UNSUPPORTED_Val      _U_(0x0)                                             /**< (MPDDRC_CR) Unaligned access is not supported.  */
#define   MPDDRC_CR_UNAL_SUPPORTED_Val        _U_(0x1)                                             /**< (MPDDRC_CR) Unaligned access is supported.This mode must be enabled when accessing DDR memory by DMA (masters supporting byte strobes).  */
#define MPDDRC_CR_UNAL_UNSUPPORTED            (MPDDRC_CR_UNAL_UNSUPPORTED_Val << MPDDRC_CR_UNAL_Pos) /**< (MPDDRC_CR) Unaligned access is not supported. Position  */
#define MPDDRC_CR_UNAL_SUPPORTED              (MPDDRC_CR_UNAL_SUPPORTED_Val << MPDDRC_CR_UNAL_Pos) /**< (MPDDRC_CR) Unaligned access is supported.This mode must be enabled when accessing DDR memory by DMA (masters supporting byte strobes). Position  */
#define MPDDRC_CR_Msk                         _U_(0x00F973FF)                                      /**< (MPDDRC_CR) Register Mask  */

#define MPDDRC_CR_LC_LPDDR_Pos                _U_(19)                                              /**< (MPDDRC_CR Position) Low-cost Low-power DDRx */
#define MPDDRC_CR_LC_LPDDR_Msk                (_U_(0x1) << MPDDRC_CR_LC_LPDDR_Pos)                 /**< (MPDDRC_CR Mask) LC_LPDDR */
#define MPDDRC_CR_LC_LPDDR(value)             (MPDDRC_CR_LC_LPDDR_Msk & ((value) << MPDDRC_CR_LC_LPDDR_Pos)) 

