Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/* -------- MPDDRC_OCMS : (MPDDRC Offset: 0x38) (R/W 32) OCMS Register -------- */
#define MPDDRC_OCMS_SCR_EN_Pos                _U_(0)                                               /**< (MPDDRC_OCMS) Scrambling Enable Position */
#define MPDDRC_OCMS_SCR_EN_Msk                (_U_(0x1) << MPDDRC_OCMS_SCR_EN_Pos)                 /**< (MPDDRC_OCMS) Scrambling Enable Mask */
#define MPDDRC_OCMS_SCR_EN(value)             (MPDDRC_OCMS_SCR_EN_Msk & ((value) << MPDDRC_OCMS_SCR_EN_Pos))
#define MPDDRC_OCMS_TAMPCLR_Pos               _U_(4)                                               /**< (MPDDRC_OCMS) Tamper Clear Enable Position */
#define MPDDRC_OCMS_TAMPCLR_Msk               (_U_(0x1) << MPDDRC_OCMS_TAMPCLR_Pos)                /**< (MPDDRC_OCMS) Tamper Clear Enable Mask */
#define MPDDRC_OCMS_TAMPCLR(value)            (MPDDRC_OCMS_TAMPCLR_Msk & ((value) << MPDDRC_OCMS_TAMPCLR_Pos))
#define MPDDRC_OCMS_Msk                       _U_(0x00000011)                                      /**< (MPDDRC_OCMS) Register Mask  */


/* -------- MPDDRC_OCMS_KEY1 : (MPDDRC Offset: 0x3C) ( /W 32) OCMS KEY1 Register -------- */
#define MPDDRC_OCMS_KEY1_KEY1_Pos             _U_(0)                                               /**< (MPDDRC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Position */
#define MPDDRC_OCMS_KEY1_KEY1_Msk             (_U_(0xFFFFFFFF) << MPDDRC_OCMS_KEY1_KEY1_Pos)       /**< (MPDDRC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define MPDDRC_OCMS_KEY1_KEY1(value)          (MPDDRC_OCMS_KEY1_KEY1_Msk & ((value) << MPDDRC_OCMS_KEY1_KEY1_Pos))
#define MPDDRC_OCMS_KEY1_Msk                  _U_(0xFFFFFFFF)                                      /**< (MPDDRC_OCMS_KEY1) Register Mask  */


/* -------- MPDDRC_OCMS_KEY2 : (MPDDRC Offset: 0x40) ( /W 32) OCMS KEY2 Register -------- */
#define MPDDRC_OCMS_KEY2_KEY2_Pos             _U_(0)                                               /**< (MPDDRC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Position */
#define MPDDRC_OCMS_KEY2_KEY2_Msk             (_U_(0xFFFFFFFF) << MPDDRC_OCMS_KEY2_KEY2_Pos)       /**< (MPDDRC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define MPDDRC_OCMS_KEY2_KEY2(value)          (MPDDRC_OCMS_KEY2_KEY2_Msk & ((value) << MPDDRC_OCMS_KEY2_KEY2_Pos))
#define MPDDRC_OCMS_KEY2_Msk                  _U_(0xFFFFFFFF)                                      /**< (MPDDRC_OCMS_KEY2) Register Mask  */


/* -------- MPDDRC_CONF_ARBITER : (MPDDRC Offset: 0x44) (R/W 32) Configuration Arbiter Register -------- */
#define MPDDRC_CONF_ARBITER_ARB_Pos           _U_(0)                                               /**< (MPDDRC_CONF_ARBITER) Type of Arbitration Position */
#define MPDDRC_CONF_ARBITER_ARB_Msk           (_U_(0x3) << MPDDRC_CONF_ARBITER_ARB_Pos)            /**< (MPDDRC_CONF_ARBITER) Type of Arbitration Mask */
#define MPDDRC_CONF_ARBITER_ARB(value)        (MPDDRC_CONF_ARBITER_ARB_Msk & ((value) << MPDDRC_CONF_ARBITER_ARB_Pos))
#define   MPDDRC_CONF_ARBITER_ARB_ROUND_Val   _U_(0x0)                                             /**< (MPDDRC_CONF_ARBITER) Round-Robin Policy  */
#define   MPDDRC_CONF_ARBITER_ARB_NB_REQUEST_Val _U_(0x1)                                             /**< (MPDDRC_CONF_ARBITER) Request Policy  */
#define   MPDDRC_CONF_ARBITER_ARB_BANDWIDTH_Val _U_(0x2)                                             /**< (MPDDRC_CONF_ARBITER) Bandwidth Policy  */
#define   MPDDRC_CONF_ARBITER_ARB_LQOS_Val    _U_(0x3)                                             /**< (MPDDRC_CONF_ARBITER) Quality of Service Policy  */
#define MPDDRC_CONF_ARBITER_ARB_ROUND         (MPDDRC_CONF_ARBITER_ARB_ROUND_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /**< (MPDDRC_CONF_ARBITER) Round-Robin Policy Position  */
#define MPDDRC_CONF_ARBITER_ARB_NB_REQUEST    (MPDDRC_CONF_ARBITER_ARB_NB_REQUEST_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /**< (MPDDRC_CONF_ARBITER) Request Policy Position  */
#define MPDDRC_CONF_ARBITER_ARB_BANDWIDTH     (MPDDRC_CONF_ARBITER_ARB_BANDWIDTH_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /**< (MPDDRC_CONF_ARBITER) Bandwidth Policy Position  */
#define MPDDRC_CONF_ARBITER_ARB_LQOS          (MPDDRC_CONF_ARBITER_ARB_LQOS_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /**< (MPDDRC_CONF_ARBITER) Quality of Service Policy Position  */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos   _U_(3)                                               /**< (MPDDRC_CONF_ARBITER) Bandwidth Max or Current Position */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Msk   (_U_(0x1) << MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos)    /**< (MPDDRC_CONF_ARBITER) Bandwidth Max or Current Mask */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR(value) (MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Msk & ((value) << MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos))
#define MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos      _U_(8)                                               /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P0_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos)       /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P0(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P0_Msk & ((value) << MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos))
#define MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos      _U_(9)                                               /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P1_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos)       /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P1(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P1_Msk & ((value) << MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos))
#define MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos      _U_(10)                                              /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P2_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos)       /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P2(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P2_Msk & ((value) << MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos))
#define MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos      _U_(11)                                              /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P3_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos)       /**< (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P3(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P3_Msk & ((value) << MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos))
#define MPDDRC_CONF_ARBITER_MA_PR_P0_Pos      _U_(16)                                              /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P0_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P0_Pos)       /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P0(value)   (MPDDRC_CONF_ARBITER_MA_PR_P0_Msk & ((value) << MPDDRC_CONF_ARBITER_MA_PR_P0_Pos))
#define MPDDRC_CONF_ARBITER_MA_PR_P1_Pos      _U_(17)                                              /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P1_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P1_Pos)       /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P1(value)   (MPDDRC_CONF_ARBITER_MA_PR_P1_Msk & ((value) << MPDDRC_CONF_ARBITER_MA_PR_P1_Pos))
#define MPDDRC_CONF_ARBITER_MA_PR_P2_Pos      _U_(18)                                              /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P2_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P2_Pos)       /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P2(value)   (MPDDRC_CONF_ARBITER_MA_PR_P2_Msk & ((value) << MPDDRC_CONF_ARBITER_MA_PR_P2_Pos))
#define MPDDRC_CONF_ARBITER_MA_PR_P3_Pos      _U_(19)                                              /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P3_Msk      (_U_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P3_Pos)       /**< (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P3(value)   (MPDDRC_CONF_ARBITER_MA_PR_P3_Msk & ((value) << MPDDRC_CONF_ARBITER_MA_PR_P3_Pos))
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos  _U_(24)                                              /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0_Msk  (_U_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos)   /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P0_Msk & ((value) << MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos))
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos  _U_(25)                                              /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1_Msk  (_U_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos)   /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P1_Msk & ((value) << MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos))
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos  _U_(26)                                              /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2_Msk  (_U_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos)   /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P2_Msk & ((value) << MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos))
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos  _U_(27)                                              /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3_Msk  (_U_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos)   /**< (MPDDRC_CONF_ARBITER) Bandwidth Arbitration Mode on Port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P3_Msk & ((value) << MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos))
#define MPDDRC_CONF_ARBITER_Msk               _U_(0x0F0F0F0B)                                      /**< (MPDDRC_CONF_ARBITER) Register Mask  */

