Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/* TOTAL_LATENCY_QOS23 mode */
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2_Pos _U_(0)                                               /**< (MPDDRC_MINFO0) Total Latency on Port 2 [x = 0..3] when value of qos is 2 Position */
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2_Msk (_U_(0xFFFF) << MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2_Pos) /**< (MPDDRC_MINFO0) Total Latency on Port 2 [x = 0..3] when value of qos is 2 Mask */
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2(value) (MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2_Msk & ((value) << MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS2_Pos))
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3_Pos _U_(16)                                              /**< (MPDDRC_MINFO0) Total Latency on Port 3 [x = 0..3] when value of qos is 3 Position */
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3_Msk (_U_(0xFFFF) << MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3_Pos) /**< (MPDDRC_MINFO0) Total Latency on Port 3 [x = 0..3] when value of qos is 3 Mask */
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3(value) (MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3_Msk & ((value) << MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_P0_TOTAL_LATENCY_QOS3_Pos))
#define MPDDRC_MINFO0_TOTAL_LATENCY_QOS23_Msk _U_(0xFFFFFFFF)                                       /**< (MPDDRC_MINFO0_TOTAL_LATENCY_QOS23) Register Mask  */


/* -------- MPDDRC_MINFO1 : (MPDDRC Offset: 0x88) ( R/ 32) Monitor Information Port 1 Register -------- */
#define MPDDRC_MINFO1_Msk                     _U_(0x00000000)                                      /**< (MPDDRC_MINFO1) Register Mask  */

/* MAX_WAIT mode */
#define MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING_Pos _U_(0)                                               /**< (MPDDRC_MINFO1) Address High on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING_Msk (_U_(0xFFFF) << MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING_Pos) /**< (MPDDRC_MINFO1) Address High on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING(value) (MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING_Msk & ((value) << MPDDRC_MINFO1_MAX_WAIT_MAX_PORT1_WAITING_Pos))
#define MPDDRC_MINFO1_MAX_WAIT_BURST_Pos      _U_(16)                                              /**< (MPDDRC_MINFO1) Type of Burst on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_Msk      (_U_(0x7) << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos)       /**< (MPDDRC_MINFO1) Type of Burst on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_MAX_WAIT_BURST(value)   (MPDDRC_MINFO1_MAX_WAIT_BURST_Msk & ((value) << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos))
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_SINGLE_Val _U_(0x0)                                             /**< (MPDDRC_MINFO1) Single transfer  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_INCR_Val _U_(0x1)                                             /**< (MPDDRC_MINFO1) Incrementing burst of unspecified length  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP4_Val _U_(0x2)                                             /**< (MPDDRC_MINFO1) 4-beat wrapping burst  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_INCR4_Val _U_(0x3)                                             /**< (MPDDRC_MINFO1) 4-beat incrementing burst  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP8_Val _U_(0x4)                                             /**< (MPDDRC_MINFO1) 8-beat wrapping burst  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_INCR8_Val _U_(0x5)                                             /**< (MPDDRC_MINFO1) 8-beat incrementing burst  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP16_Val _U_(0x6)                                             /**< (MPDDRC_MINFO1) 16-beat wrapping burst  */
#define   MPDDRC_MINFO1_MAX_WAIT_BURST_INCR16_Val _U_(0x7)                                             /**< (MPDDRC_MINFO1) 16-beat incrementing burst  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_SINGLE   (MPDDRC_MINFO1_MAX_WAIT_BURST_SINGLE_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) Single transfer Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_INCR     (MPDDRC_MINFO1_MAX_WAIT_BURST_INCR_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) Incrementing burst of unspecified length Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP4    (MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP4_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 4-beat wrapping burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_INCR4    (MPDDRC_MINFO1_MAX_WAIT_BURST_INCR4_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 4-beat incrementing burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP8    (MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP8_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 8-beat wrapping burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_INCR8    (MPDDRC_MINFO1_MAX_WAIT_BURST_INCR8_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 8-beat incrementing burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP16   (MPDDRC_MINFO1_MAX_WAIT_BURST_WRAP16_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 16-beat wrapping burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_BURST_INCR16   (MPDDRC_MINFO1_MAX_WAIT_BURST_INCR16_Val << MPDDRC_MINFO1_MAX_WAIT_BURST_Pos) /**< (MPDDRC_MINFO1) 16-beat incrementing burst Position  */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos       _U_(20)                                              /**< (MPDDRC_MINFO1) Transfer Size on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_Msk       (_U_(0x7) << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos)        /**< (MPDDRC_MINFO1) Transfer Size on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE(value)    (MPDDRC_MINFO1_MAX_WAIT_SIZE_Msk & ((value) << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos))
#define   MPDDRC_MINFO1_MAX_WAIT_SIZE_8BITS_Val _U_(0x0)                                             /**< (MPDDRC_MINFO1) Byte transfer  */
#define   MPDDRC_MINFO1_MAX_WAIT_SIZE_16BITS_Val _U_(0x1)                                             /**< (MPDDRC_MINFO1) Halfword transfer  */
#define   MPDDRC_MINFO1_MAX_WAIT_SIZE_32BITS_Val _U_(0x2)                                             /**< (MPDDRC_MINFO1) Word transfer  */
#define   MPDDRC_MINFO1_MAX_WAIT_SIZE_64BITS_Val _U_(0x3)                                             /**< (MPDDRC_MINFO1) Dword transfer  */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_8BITS     (MPDDRC_MINFO1_MAX_WAIT_SIZE_8BITS_Val << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos) /**< (MPDDRC_MINFO1) Byte transfer Position  */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_16BITS    (MPDDRC_MINFO1_MAX_WAIT_SIZE_16BITS_Val << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos) /**< (MPDDRC_MINFO1) Halfword transfer Position  */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_32BITS    (MPDDRC_MINFO1_MAX_WAIT_SIZE_32BITS_Val << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos) /**< (MPDDRC_MINFO1) Word transfer Position  */
#define MPDDRC_MINFO1_MAX_WAIT_SIZE_64BITS    (MPDDRC_MINFO1_MAX_WAIT_SIZE_64BITS_Val << MPDDRC_MINFO1_MAX_WAIT_SIZE_Pos) /**< (MPDDRC_MINFO1) Dword transfer Position  */
#define MPDDRC_MINFO1_MAX_WAIT_READ_WRITE_Pos _U_(24)                                              /**< (MPDDRC_MINFO1) Read or Write Access on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_MAX_WAIT_READ_WRITE_Msk (_U_(0x1) << MPDDRC_MINFO1_MAX_WAIT_READ_WRITE_Pos)  /**< (MPDDRC_MINFO1) Read or Write Access on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_MAX_WAIT_READ_WRITE(value) (MPDDRC_MINFO1_MAX_WAIT_READ_WRITE_Msk & ((value) << MPDDRC_MINFO1_MAX_WAIT_READ_WRITE_Pos))
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos       _U_(25)                                              /**< (MPDDRC_MINFO1) Value of Quality Of Service on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_Msk       (_U_(0x3) << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos)        /**< (MPDDRC_MINFO1) Value of Quality Of Service on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS(value)    (MPDDRC_MINFO1_MAX_WAIT_LQOS_Msk & ((value) << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos))
#define   MPDDRC_MINFO1_MAX_WAIT_LQOS_BACKGROUND_Val _U_(0x0)                                             /**< (MPDDRC_MINFO1) Background Transfers  */
#define   MPDDRC_MINFO1_MAX_WAIT_LQOS_BANDWIDTH_Val _U_(0x1)                                             /**< (MPDDRC_MINFO1) Bandwidth Sensitive  */
#define   MPDDRC_MINFO1_MAX_WAIT_LQOS_SENSITIVE_LAT_Val _U_(0x2)                                             /**< (MPDDRC_MINFO1) Latency Sensitive  */
#define   MPDDRC_MINFO1_MAX_WAIT_LQOS_CRITICAL_LAT_Val _U_(0x3)                                             /**< (MPDDRC_MINFO1) Latency Critical  */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_BACKGROUND (MPDDRC_MINFO1_MAX_WAIT_LQOS_BACKGROUND_Val << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos) /**< (MPDDRC_MINFO1) Background Transfers Position  */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_BANDWIDTH (MPDDRC_MINFO1_MAX_WAIT_LQOS_BANDWIDTH_Val << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos) /**< (MPDDRC_MINFO1) Bandwidth Sensitive Position  */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_SENSITIVE_LAT (MPDDRC_MINFO1_MAX_WAIT_LQOS_SENSITIVE_LAT_Val << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos) /**< (MPDDRC_MINFO1) Latency Sensitive Position  */
#define MPDDRC_MINFO1_MAX_WAIT_LQOS_CRITICAL_LAT (MPDDRC_MINFO1_MAX_WAIT_LQOS_CRITICAL_LAT_Val << MPDDRC_MINFO1_MAX_WAIT_LQOS_Pos) /**< (MPDDRC_MINFO1) Latency Critical Position  */
#define MPDDRC_MINFO1_MAX_WAIT_Msk            _U_(0x0777FFFF)                                       /**< (MPDDRC_MINFO1_MAX_WAIT) Register Mask  */

/* NB_TRANSFERS mode */
#define MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS_Pos _U_(0)                                               /**< (MPDDRC_MINFO1) Number of Transfers on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS_Msk (_U_(0xFFFFFFFF) << MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS_Pos) /**< (MPDDRC_MINFO1) Number of Transfers on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS(value) (MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS_Msk & ((value) << MPDDRC_MINFO1_NB_TRANSFERS_P1_NB_TRANSFERS_Pos))
#define MPDDRC_MINFO1_NB_TRANSFERS_Msk        _U_(0xFFFFFFFF)                                       /**< (MPDDRC_MINFO1_NB_TRANSFERS) Register Mask  */

/* TOTAL_LATENCY mode */
#define MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY_Pos _U_(0)                                               /**< (MPDDRC_MINFO1) Total Latency on Port x [x = 0..3] Position */
#define MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY_Msk (_U_(0xFFFFFFFF) << MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY_Pos) /**< (MPDDRC_MINFO1) Total Latency on Port x [x = 0..3] Mask */
#define MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY(value) (MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY_Msk & ((value) << MPDDRC_MINFO1_TOTAL_LATENCY_P1_TOTAL_LATENCY_Pos))
#define MPDDRC_MINFO1_TOTAL_LATENCY_Msk       _U_(0xFFFFFFFF)                                       /**< (MPDDRC_MINFO1_TOTAL_LATENCY) Register Mask  */

/* TOTAL_LATENCY_QOS01 mode */
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0_Pos _U_(0)                                               /**< (MPDDRC_MINFO1) Total Latency on Port 0 [x = 0..3] when value of qos is 0 Position */
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0_Msk (_U_(0xFFFF) << MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0_Pos) /**< (MPDDRC_MINFO1) Total Latency on Port 0 [x = 0..3] when value of qos is 0 Mask */
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0(value) (MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0_Msk & ((value) << MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS0_Pos))
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1_Pos _U_(16)                                              /**< (MPDDRC_MINFO1) Total Latency on Port 1 [x = 0..3] when value of qos is 1 Position */
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1_Msk (_U_(0xFFFF) << MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1_Pos) /**< (MPDDRC_MINFO1) Total Latency on Port 1 [x = 0..3] when value of qos is 1 Mask */
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1(value) (MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1_Msk & ((value) << MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_P1_TOTAL_LATENCY_QOS1_Pos))
#define MPDDRC_MINFO1_TOTAL_LATENCY_QOS01_Msk _U_(0xFFFFFFFF)                                       /**< (MPDDRC_MINFO1_TOTAL_LATENCY_QOS01) Register Mask  */

