Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/* TOTAL_LATENCY_QOS23 mode */
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2_Pos _U_(0)                                               /**< (MPDDRC_MINFO3) Total Latency on Port 2 [x = 0..3] when value of qos is 2 Position */
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2_Msk (_U_(0xFFFF) << MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2_Pos) /**< (MPDDRC_MINFO3) Total Latency on Port 2 [x = 0..3] when value of qos is 2 Mask */
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2(value) (MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2_Msk & ((value) << MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS2_Pos))
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3_Pos _U_(16)                                              /**< (MPDDRC_MINFO3) Total Latency on Port 3 [x = 0..3] when value of qos is 3 Position */
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3_Msk (_U_(0xFFFF) << MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3_Pos) /**< (MPDDRC_MINFO3) Total Latency on Port 3 [x = 0..3] when value of qos is 3 Mask */
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3(value) (MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3_Msk & ((value) << MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_P3_TOTAL_LATENCY_QOS3_Pos))
#define MPDDRC_MINFO3_TOTAL_LATENCY_QOS23_Msk _U_(0xFFFFFFFF)                                       /**< (MPDDRC_MINFO3_TOTAL_LATENCY_QOS23) Register Mask  */


/* -------- MPDDRC_IER : (MPDDRC Offset: 0xC0) ( /W 32) Interrupt Enable Register -------- */
#define MPDDRC_IER_SEC_Pos                    _U_(0)                                               /**< (MPDDRC_IER) Security and /or Safety Interrupt Enable Position */
#define MPDDRC_IER_SEC_Msk                    (_U_(0x1) << MPDDRC_IER_SEC_Pos)                     /**< (MPDDRC_IER) Security and /or Safety Interrupt Enable Mask */
#define MPDDRC_IER_SEC(value)                 (MPDDRC_IER_SEC_Msk & ((value) << MPDDRC_IER_SEC_Pos))
#define MPDDRC_IER_RD_ERR_Pos                 _U_(1)                                               /**< (MPDDRC_IER) Read Error Interrupt Enable Position */
#define MPDDRC_IER_RD_ERR_Msk                 (_U_(0x1) << MPDDRC_IER_RD_ERR_Pos)                  /**< (MPDDRC_IER) Read Error Interrupt Enable Mask */
#define MPDDRC_IER_RD_ERR(value)              (MPDDRC_IER_RD_ERR_Msk & ((value) << MPDDRC_IER_RD_ERR_Pos))
#define MPDDRC_IER_Msk                        _U_(0x00000003)                                      /**< (MPDDRC_IER) Register Mask  */


/* -------- MPDDRC_IDR : (MPDDRC Offset: 0xC4) ( /W 32) Interrupt Disable Register -------- */
#define MPDDRC_IDR_SEC_Pos                    _U_(0)                                               /**< (MPDDRC_IDR) Security and /or Safety Interrupt Disable Position */
#define MPDDRC_IDR_SEC_Msk                    (_U_(0x1) << MPDDRC_IDR_SEC_Pos)                     /**< (MPDDRC_IDR) Security and /or Safety Interrupt Disable Mask */
#define MPDDRC_IDR_SEC(value)                 (MPDDRC_IDR_SEC_Msk & ((value) << MPDDRC_IDR_SEC_Pos))
#define MPDDRC_IDR_RD_ERR_Pos                 _U_(1)                                               /**< (MPDDRC_IDR) Read Error Interrupt Disable Position */
#define MPDDRC_IDR_RD_ERR_Msk                 (_U_(0x1) << MPDDRC_IDR_RD_ERR_Pos)                  /**< (MPDDRC_IDR) Read Error Interrupt Disable Mask */
#define MPDDRC_IDR_RD_ERR(value)              (MPDDRC_IDR_RD_ERR_Msk & ((value) << MPDDRC_IDR_RD_ERR_Pos))
#define MPDDRC_IDR_Msk                        _U_(0x00000003)                                      /**< (MPDDRC_IDR) Register Mask  */


/* -------- MPDDRC_IMR : (MPDDRC Offset: 0xC8) ( R/ 32) Interrupt Mask Register -------- */
#define MPDDRC_IMR_SEC_Pos                    _U_(0)                                               /**< (MPDDRC_IMR) Security and /or Safety Interrupt Mask Position */
#define MPDDRC_IMR_SEC_Msk                    (_U_(0x1) << MPDDRC_IMR_SEC_Pos)                     /**< (MPDDRC_IMR) Security and /or Safety Interrupt Mask Mask */
#define MPDDRC_IMR_SEC(value)                 (MPDDRC_IMR_SEC_Msk & ((value) << MPDDRC_IMR_SEC_Pos))
#define MPDDRC_IMR_RD_ERR_Pos                 _U_(1)                                               /**< (MPDDRC_IMR) Read Error Interrupt Mask Position */
#define MPDDRC_IMR_RD_ERR_Msk                 (_U_(0x1) << MPDDRC_IMR_RD_ERR_Pos)                  /**< (MPDDRC_IMR) Read Error Interrupt Mask Mask */
#define MPDDRC_IMR_RD_ERR(value)              (MPDDRC_IMR_RD_ERR_Msk & ((value) << MPDDRC_IMR_RD_ERR_Pos))
#define MPDDRC_IMR_Msk                        _U_(0x00000003)                                      /**< (MPDDRC_IMR) Register Mask  */


/* -------- MPDDRC_ISR : (MPDDRC Offset: 0xCC) ( R/ 32) Interrupt Status Register -------- */
#define MPDDRC_ISR_SEC_Pos                    _U_(0)                                               /**< (MPDDRC_ISR) Security and /or Safety Event Position */
#define MPDDRC_ISR_SEC_Msk                    (_U_(0x1) << MPDDRC_ISR_SEC_Pos)                     /**< (MPDDRC_ISR) Security and /or Safety Event Mask */
#define MPDDRC_ISR_SEC(value)                 (MPDDRC_ISR_SEC_Msk & ((value) << MPDDRC_ISR_SEC_Pos))
#define MPDDRC_ISR_RD_ERR_Pos                 _U_(1)                                               /**< (MPDDRC_ISR) Read Error Position */
#define MPDDRC_ISR_RD_ERR_Msk                 (_U_(0x1) << MPDDRC_ISR_RD_ERR_Pos)                  /**< (MPDDRC_ISR) Read Error Mask */
#define MPDDRC_ISR_RD_ERR(value)              (MPDDRC_ISR_RD_ERR_Msk & ((value) << MPDDRC_ISR_RD_ERR_Pos))
#define MPDDRC_ISR_Msk                        _U_(0x00000003)                                      /**< (MPDDRC_ISR) Register Mask  */


/* -------- MPDDRC_SAFETY : (MPDDRC Offset: 0xD0) (R/W 32) Safety Register -------- */
#define MPDDRC_SAFETY_ADDRESS_Pos             _U_(0)                                               /**< (MPDDRC_SAFETY) Memory Device Address Position */
#define MPDDRC_SAFETY_ADDRESS_Msk             (_U_(0xFFFFFFF) << MPDDRC_SAFETY_ADDRESS_Pos)        /**< (MPDDRC_SAFETY) Memory Device Address Mask */
#define MPDDRC_SAFETY_ADDRESS(value)          (MPDDRC_SAFETY_ADDRESS_Msk & ((value) << MPDDRC_SAFETY_ADDRESS_Pos))
#define MPDDRC_SAFETY_EN_Pos                  _U_(28)                                              /**< (MPDDRC_SAFETY) Enable Periodic Check of Memory Device Position */
#define MPDDRC_SAFETY_EN_Msk                  (_U_(0x1) << MPDDRC_SAFETY_EN_Pos)                   /**< (MPDDRC_SAFETY) Enable Periodic Check of Memory Device Mask */
#define MPDDRC_SAFETY_EN(value)               (MPDDRC_SAFETY_EN_Msk & ((value) << MPDDRC_SAFETY_EN_Pos))
#define MPDDRC_SAFETY_Msk                     _U_(0x1FFFFFFF)                                      /**< (MPDDRC_SAFETY) Register Mask  */


/* -------- MPDDRC_WPMR : (MPDDRC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define MPDDRC_WPMR_WPEN_Pos                  _U_(0)                                               /**< (MPDDRC_WPMR) Write Protection Enable Position */
#define MPDDRC_WPMR_WPEN_Msk                  (_U_(0x1) << MPDDRC_WPMR_WPEN_Pos)                   /**< (MPDDRC_WPMR) Write Protection Enable Mask */
#define MPDDRC_WPMR_WPEN(value)               (MPDDRC_WPMR_WPEN_Msk & ((value) << MPDDRC_WPMR_WPEN_Pos))
#define MPDDRC_WPMR_WPITEN_Pos                _U_(1)                                               /**< (MPDDRC_WPMR) Write Protection Interruption Enable Position */
#define MPDDRC_WPMR_WPITEN_Msk                (_U_(0x1) << MPDDRC_WPMR_WPITEN_Pos)                 /**< (MPDDRC_WPMR) Write Protection Interruption Enable Mask */
#define MPDDRC_WPMR_WPITEN(value)             (MPDDRC_WPMR_WPITEN_Msk & ((value) << MPDDRC_WPMR_WPITEN_Pos))
#define MPDDRC_WPMR_FIRSTE_Pos                _U_(4)                                               /**< (MPDDRC_WPMR) First Error Report Enable Position */
#define MPDDRC_WPMR_FIRSTE_Msk                (_U_(0x1) << MPDDRC_WPMR_FIRSTE_Pos)                 /**< (MPDDRC_WPMR) First Error Report Enable Mask */
#define MPDDRC_WPMR_FIRSTE(value)             (MPDDRC_WPMR_FIRSTE_Msk & ((value) << MPDDRC_WPMR_FIRSTE_Pos))
#define MPDDRC_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (MPDDRC_WPMR) Write Protection Key Position */
#define MPDDRC_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << MPDDRC_WPMR_WPKEY_Pos)             /**< (MPDDRC_WPMR) Write Protection Key Mask */
#define MPDDRC_WPMR_WPKEY(value)              (MPDDRC_WPMR_WPKEY_Msk & ((value) << MPDDRC_WPMR_WPKEY_Pos))
#define   MPDDRC_WPMR_WPKEY_PASSWD_Val        _U_(0x444452)                                        /**< (MPDDRC_WPMR) Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits.Always reads as 0.  */
#define MPDDRC_WPMR_WPKEY_PASSWD              (MPDDRC_WPMR_WPKEY_PASSWD_Val << MPDDRC_WPMR_WPKEY_Pos) /**< (MPDDRC_WPMR) Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits.Always reads as 0. Position  */
#define MPDDRC_WPMR_Msk                       _U_(0xFFFFFF13)                                      /**< (MPDDRC_WPMR) Register Mask  */


/* -------- MPDDRC_WPSR : (MPDDRC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define MPDDRC_WPSR_WPVS_Pos                  _U_(0)                                               /**< (MPDDRC_WPSR) Write Protection Enable Position */
#define MPDDRC_WPSR_WPVS_Msk                  (_U_(0x1) << MPDDRC_WPSR_WPVS_Pos)                   /**< (MPDDRC_WPSR) Write Protection Enable Mask */
#define MPDDRC_WPSR_WPVS(value)               (MPDDRC_WPSR_WPVS_Msk & ((value) << MPDDRC_WPSR_WPVS_Pos))
#define MPDDRC_WPSR_CGD_Pos                   _U_(1)                                               /**< (MPDDRC_WPSR) Clock Glitch Detected (cleared on read) Position */
#define MPDDRC_WPSR_CGD_Msk                   (_U_(0x1) << MPDDRC_WPSR_CGD_Pos)                    /**< (MPDDRC_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define MPDDRC_WPSR_CGD(value)                (MPDDRC_WPSR_CGD_Msk & ((value) << MPDDRC_WPSR_CGD_Pos))
#define MPDDRC_WPSR_SEQE_Pos                  _U_(2)                                               /**< (MPDDRC_WPSR) Internal Sequencer Error (cleared on read) Position */
#define MPDDRC_WPSR_SEQE_Msk                  (_U_(0x1) << MPDDRC_WPSR_SEQE_Pos)                   /**< (MPDDRC_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define MPDDRC_WPSR_SEQE(value)               (MPDDRC_WPSR_SEQE_Msk & ((value) << MPDDRC_WPSR_SEQE_Pos))
#define MPDDRC_WPSR_SWE_Pos                   _U_(3)                                               /**< (MPDDRC_WPSR) Software Control Error (cleared on read) Position */
#define MPDDRC_WPSR_SWE_Msk                   (_U_(0x1) << MPDDRC_WPSR_SWE_Pos)                    /**< (MPDDRC_WPSR) Software Control Error (cleared on read) Mask */
#define MPDDRC_WPSR_SWE(value)                (MPDDRC_WPSR_SWE_Msk & ((value) << MPDDRC_WPSR_SWE_Pos))
#define MPDDRC_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (MPDDRC_WPSR) Write Protection Violation Source Position */
#define MPDDRC_WPSR_WPVSRC_Msk                (_U_(0xFFFF) << MPDDRC_WPSR_WPVSRC_Pos)              /**< (MPDDRC_WPSR) Write Protection Violation Source Mask */
#define MPDDRC_WPSR_WPVSRC(value)             (MPDDRC_WPSR_WPVSRC_Msk & ((value) << MPDDRC_WPSR_WPVSRC_Pos))
#define MPDDRC_WPSR_SWETYP_Pos                _U_(24)                                              /**< (MPDDRC_WPSR) Software Error Type (cleared on read) Position */
#define MPDDRC_WPSR_SWETYP_Msk                (_U_(0x3) << MPDDRC_WPSR_SWETYP_Pos)                 /**< (MPDDRC_WPSR) Software Error Type (cleared on read) Mask */
#define MPDDRC_WPSR_SWETYP(value)             (MPDDRC_WPSR_SWETYP_Msk & ((value) << MPDDRC_WPSR_SWETYP_Pos))
#define   MPDDRC_WPSR_SWETYP_READ_WO_Val      _U_(0x0)                                             /**< (MPDDRC_WPSR) A write-only register has been read (warning).  */
#define   MPDDRC_WPSR_SWETYP_WRITE_RO_Val     _U_(0x1)                                             /**< (MPDDRC_WPSR) MPDDRC is enabled and a write access has been performed on a read-only register (warning).  */
#define   MPDDRC_WPSR_SWETYP_UNDEF_RW_Val     _U_(0x2)                                             /**< (MPDDRC_WPSR) Access to an undefined address (warning).  */
#define   MPDDRC_WPSR_SWETYP_W_AFTER_INIT_Val _U_(0x3)                                             /**< (MPDDRC_WPSR) Abnormal use of MPDDRC user interface when memory device is already configured and initialized, i.e., if MPDDRC_RTR.COUNT > 0 (error).  */
#define MPDDRC_WPSR_SWETYP_READ_WO            (MPDDRC_WPSR_SWETYP_READ_WO_Val << MPDDRC_WPSR_SWETYP_Pos) /**< (MPDDRC_WPSR) A write-only register has been read (warning). Position  */
#define MPDDRC_WPSR_SWETYP_WRITE_RO           (MPDDRC_WPSR_SWETYP_WRITE_RO_Val << MPDDRC_WPSR_SWETYP_Pos) /**< (MPDDRC_WPSR) MPDDRC is enabled and a write access has been performed on a read-only register (warning). Position  */
#define MPDDRC_WPSR_SWETYP_UNDEF_RW           (MPDDRC_WPSR_SWETYP_UNDEF_RW_Val << MPDDRC_WPSR_SWETYP_Pos) /**< (MPDDRC_WPSR) Access to an undefined address (warning). Position  */
#define MPDDRC_WPSR_SWETYP_W_AFTER_INIT       (MPDDRC_WPSR_SWETYP_W_AFTER_INIT_Val << MPDDRC_WPSR_SWETYP_Pos) /**< (MPDDRC_WPSR) Abnormal use of MPDDRC user interface when memory device is already configured and initialized, i.e., if MPDDRC_RTR.COUNT > 0 (error). Position  */
#define MPDDRC_WPSR_ECLASS_Pos                _U_(31)                                              /**< (MPDDRC_WPSR) Software Error Class (cleared on read) Position */
#define MPDDRC_WPSR_ECLASS_Msk                (_U_(0x1) << MPDDRC_WPSR_ECLASS_Pos)                 /**< (MPDDRC_WPSR) Software Error Class (cleared on read) Mask */
#define MPDDRC_WPSR_ECLASS(value)             (MPDDRC_WPSR_ECLASS_Msk & ((value) << MPDDRC_WPSR_ECLASS_Pos))
#define   MPDDRC_WPSR_ECLASS_WARNING_Val      _U_(0x0)                                             /**< (MPDDRC_WPSR) An abnormal access that does not affect system functionality is performed.  */
#define   MPDDRC_WPSR_ECLASS_ERROR_Val        _U_(0x1)                                             /**< (MPDDRC_WPSR) An access is performed into some registers after memory device initialization sequence.  */
#define MPDDRC_WPSR_ECLASS_WARNING            (MPDDRC_WPSR_ECLASS_WARNING_Val << MPDDRC_WPSR_ECLASS_Pos) /**< (MPDDRC_WPSR) An abnormal access that does not affect system functionality is performed. Position  */
#define MPDDRC_WPSR_ECLASS_ERROR              (MPDDRC_WPSR_ECLASS_ERROR_Val << MPDDRC_WPSR_ECLASS_Pos) /**< (MPDDRC_WPSR) An access is performed into some registers after memory device initialization sequence. Position  */
#define MPDDRC_WPSR_Msk                       _U_(0x83FFFF0F)                                      /**< (MPDDRC_WPSR) Register Mask  */


