Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/* -------- MPDDRC_VERSION : (MPDDRC Offset: 0xFC) ( R/ 32) MPDDRC Version Register -------- */
#define MPDDRC_VERSION_VERSION_Pos            _U_(0)                                               /**< (MPDDRC_VERSION) Version of the Hardware Module Position */
#define MPDDRC_VERSION_VERSION_Msk            (_U_(0xFFFF) << MPDDRC_VERSION_VERSION_Pos)          /**< (MPDDRC_VERSION) Version of the Hardware Module Mask */
#define MPDDRC_VERSION_VERSION(value)         (MPDDRC_VERSION_VERSION_Msk & ((value) << MPDDRC_VERSION_VERSION_Pos))
#define MPDDRC_VERSION_MFN_Pos                _U_(16)                                              /**< (MPDDRC_VERSION) Metal Fix Number Position */
#define MPDDRC_VERSION_MFN_Msk                (_U_(0xF) << MPDDRC_VERSION_MFN_Pos)                 /**< (MPDDRC_VERSION) Metal Fix Number Mask */
#define MPDDRC_VERSION_MFN(value)             (MPDDRC_VERSION_MFN_Msk & ((value) << MPDDRC_VERSION_MFN_Pos))
#define MPDDRC_VERSION_Msk                    _U_(0x000FFFFF)                                      /**< (MPDDRC_VERSION) Register Mask  */


/* -------- MPDDRC_DLL_OS : (MPDDRC Offset: 0x100) (R/W 32) MPDDRC DLL Offset Selection Register -------- */
#define MPDDRC_DLL_OS_SELOFF_Pos              _U_(0)                                               /**< (MPDDRC_DLL_OS) Offset Selection Position */
#define MPDDRC_DLL_OS_SELOFF_Msk              (_U_(0x1) << MPDDRC_DLL_OS_SELOFF_Pos)               /**< (MPDDRC_DLL_OS) Offset Selection Mask */
#define MPDDRC_DLL_OS_SELOFF(value)           (MPDDRC_DLL_OS_SELOFF_Msk & ((value) << MPDDRC_DLL_OS_SELOFF_Pos))
#define MPDDRC_DLL_OS_Msk                     _U_(0x00000001)                                      /**< (MPDDRC_DLL_OS) Register Mask  */


/* -------- MPDDRC_DLL_MAO : (MPDDRC Offset: 0x104) (R/W 32) MPDDRC DLL Master Offset Register -------- */
#define MPDDRC_DLL_MAO_MAOFF_Pos              _U_(0)                                               /**< (MPDDRC_DLL_MAO) Master Delay Line Offset Position */
#define MPDDRC_DLL_MAO_MAOFF_Msk              (_U_(0xFF) << MPDDRC_DLL_MAO_MAOFF_Pos)              /**< (MPDDRC_DLL_MAO) Master Delay Line Offset Mask */
#define MPDDRC_DLL_MAO_MAOFF(value)           (MPDDRC_DLL_MAO_MAOFF_Msk & ((value) << MPDDRC_DLL_MAO_MAOFF_Pos))
#define MPDDRC_DLL_MAO_Msk                    _U_(0x000000FF)                                      /**< (MPDDRC_DLL_MAO) Register Mask  */


/* -------- MPDDRC_DLL_SO0 : (MPDDRC Offset: 0x108) (R/W 32) MPDDRC DLL Slave Offset 0 Register -------- */
#define MPDDRC_DLL_SO0_S0OFF_Pos              _U_(0)                                               /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Position */
#define MPDDRC_DLL_SO0_S0OFF_Msk              (_U_(0xFF) << MPDDRC_DLL_SO0_S0OFF_Pos)              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Mask */
#define MPDDRC_DLL_SO0_S0OFF(value)           (MPDDRC_DLL_SO0_S0OFF_Msk & ((value) << MPDDRC_DLL_SO0_S0OFF_Pos))
#define MPDDRC_DLL_SO0_S1OFF_Pos              _U_(8)                                               /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Position */
#define MPDDRC_DLL_SO0_S1OFF_Msk              (_U_(0xFF) << MPDDRC_DLL_SO0_S1OFF_Pos)              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Mask */
#define MPDDRC_DLL_SO0_S1OFF(value)           (MPDDRC_DLL_SO0_S1OFF_Msk & ((value) << MPDDRC_DLL_SO0_S1OFF_Pos))
#define MPDDRC_DLL_SO0_S2OFF_Pos              _U_(16)                                              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Position */
#define MPDDRC_DLL_SO0_S2OFF_Msk              (_U_(0xFF) << MPDDRC_DLL_SO0_S2OFF_Pos)              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Mask */
#define MPDDRC_DLL_SO0_S2OFF(value)           (MPDDRC_DLL_SO0_S2OFF_Msk & ((value) << MPDDRC_DLL_SO0_S2OFF_Pos))
#define MPDDRC_DLL_SO0_S3OFF_Pos              _U_(24)                                              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Position */
#define MPDDRC_DLL_SO0_S3OFF_Msk              (_U_(0xFF) << MPDDRC_DLL_SO0_S3OFF_Pos)              /**< (MPDDRC_DLL_SO0) SLAVEx Delay Line Offset Mask */
#define MPDDRC_DLL_SO0_S3OFF(value)           (MPDDRC_DLL_SO0_S3OFF_Msk & ((value) << MPDDRC_DLL_SO0_S3OFF_Pos))
#define MPDDRC_DLL_SO0_Msk                    _U_(0xFFFFFFFF)                                      /**< (MPDDRC_DLL_SO0) Register Mask  */


/* -------- MPDDRC_DLL_WRO : (MPDDRC Offset: 0x110) (R/W 32) MPDDRC DLL CLKWR Offset Register -------- */
#define MPDDRC_DLL_WRO_WR0OFF_Pos             _U_(0)                                               /**< (MPDDRC_DLL_WRO) CLKWRx Delay Line Offset Position */
#define MPDDRC_DLL_WRO_WR0OFF_Msk             (_U_(0xFF) << MPDDRC_DLL_WRO_WR0OFF_Pos)             /**< (MPDDRC_DLL_WRO) CLKWRx Delay Line Offset Mask */
#define MPDDRC_DLL_WRO_WR0OFF(value)          (MPDDRC_DLL_WRO_WR0OFF_Msk & ((value) << MPDDRC_DLL_WRO_WR0OFF_Pos))
#define MPDDRC_DLL_WRO_WR1OFF_Pos             _U_(8)                                               /**< (MPDDRC_DLL_WRO) CLKWRx Delay Line Offset Position */
#define MPDDRC_DLL_WRO_WR1OFF_Msk             (_U_(0xFF) << MPDDRC_DLL_WRO_WR1OFF_Pos)             /**< (MPDDRC_DLL_WRO) CLKWRx Delay Line Offset Mask */
#define MPDDRC_DLL_WRO_WR1OFF(value)          (MPDDRC_DLL_WRO_WR1OFF_Msk & ((value) << MPDDRC_DLL_WRO_WR1OFF_Pos))
#define MPDDRC_DLL_WRO_Msk                    _U_(0x0000FFFF)                                      /**< (MPDDRC_DLL_WRO) Register Mask  */


/* -------- MPDDRC_DLL_SM : (MPDDRC Offset: 0x118) ( R/ 32) MPDDRC DLL Status Master 0 Register -------- */
#define MPDDRC_DLL_SM_MDINC_Pos               _U_(0)                                               /**< (MPDDRC_DLL_SM) MASTERx Delay Increment Position */
#define MPDDRC_DLL_SM_MDINC_Msk               (_U_(0x1) << MPDDRC_DLL_SM_MDINC_Pos)                /**< (MPDDRC_DLL_SM) MASTERx Delay Increment Mask */
#define MPDDRC_DLL_SM_MDINC(value)            (MPDDRC_DLL_SM_MDINC_Msk & ((value) << MPDDRC_DLL_SM_MDINC_Pos))
#define MPDDRC_DLL_SM_MDDEC_Pos               _U_(1)                                               /**< (MPDDRC_DLL_SM) MASTERx Delay Decrement Position */
#define MPDDRC_DLL_SM_MDDEC_Msk               (_U_(0x1) << MPDDRC_DLL_SM_MDDEC_Pos)                /**< (MPDDRC_DLL_SM) MASTERx Delay Decrement Mask */
#define MPDDRC_DLL_SM_MDDEC(value)            (MPDDRC_DLL_SM_MDDEC_Msk & ((value) << MPDDRC_DLL_SM_MDDEC_Pos))
#define MPDDRC_DLL_SM_MDOVF_Pos               _U_(2)                                               /**< (MPDDRC_DLL_SM) MASTERx Delay Overflow Flag Position */
#define MPDDRC_DLL_SM_MDOVF_Msk               (_U_(0x1) << MPDDRC_DLL_SM_MDOVF_Pos)                /**< (MPDDRC_DLL_SM) MASTERx Delay Overflow Flag Mask */
#define MPDDRC_DLL_SM_MDOVF(value)            (MPDDRC_DLL_SM_MDOVF_Msk & ((value) << MPDDRC_DLL_SM_MDOVF_Pos))
#define MPDDRC_DLL_SM_MDLVAL_Pos              _U_(8)                                               /**< (MPDDRC_DLL_SM) MASTERx Delay Lock Value Position */
#define MPDDRC_DLL_SM_MDLVAL_Msk              (_U_(0xFF) << MPDDRC_DLL_SM_MDLVAL_Pos)              /**< (MPDDRC_DLL_SM) MASTERx Delay Lock Value Mask */
#define MPDDRC_DLL_SM_MDLVAL(value)           (MPDDRC_DLL_SM_MDLVAL_Msk & ((value) << MPDDRC_DLL_SM_MDLVAL_Pos))
#define MPDDRC_DLL_SM_MDCNT_Pos               _U_(20)                                              /**< (MPDDRC_DLL_SM) MASTERx Delay Counter Value Position */
#define MPDDRC_DLL_SM_MDCNT_Msk               (_U_(0xFF) << MPDDRC_DLL_SM_MDCNT_Pos)               /**< (MPDDRC_DLL_SM) MASTERx Delay Counter Value Mask */
#define MPDDRC_DLL_SM_MDCNT(value)            (MPDDRC_DLL_SM_MDCNT_Msk & ((value) << MPDDRC_DLL_SM_MDCNT_Pos))
#define MPDDRC_DLL_SM_Msk                     _U_(0x0FF0FF07)                                      /**< (MPDDRC_DLL_SM) Register Mask  */


/* -------- MPDDRC_DLL_SSL : (MPDDRC Offset: 0x128) ( R/ 32) MPDDRC DLL Status Slave 0 Register -------- */
#define MPDDRC_DLL_SSL_SDCOVF_Pos             _U_(0)                                               /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Overflow Flag Position */
#define MPDDRC_DLL_SSL_SDCOVF_Msk             (_U_(0x1) << MPDDRC_DLL_SSL_SDCOVF_Pos)              /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Overflow Flag Mask */
#define MPDDRC_DLL_SSL_SDCOVF(value)          (MPDDRC_DLL_SSL_SDCOVF_Msk & ((value) << MPDDRC_DLL_SSL_SDCOVF_Pos))
#define MPDDRC_DLL_SSL_SDCUDF_Pos             _U_(1)                                               /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Underflow Flag Position */
#define MPDDRC_DLL_SSL_SDCUDF_Msk             (_U_(0x1) << MPDDRC_DLL_SSL_SDCUDF_Pos)              /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Underflow Flag Mask */
#define MPDDRC_DLL_SSL_SDCUDF(value)          (MPDDRC_DLL_SSL_SDCUDF_Msk & ((value) << MPDDRC_DLL_SSL_SDCUDF_Pos))
#define MPDDRC_DLL_SSL_SDERF_Pos              _U_(2)                                               /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Error Flag Position */
#define MPDDRC_DLL_SSL_SDERF_Msk              (_U_(0x1) << MPDDRC_DLL_SSL_SDERF_Pos)               /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Error Flag Mask */
#define MPDDRC_DLL_SSL_SDERF(value)           (MPDDRC_DLL_SSL_SDERF_Msk & ((value) << MPDDRC_DLL_SSL_SDERF_Pos))
#define MPDDRC_DLL_SSL_SDCNT_Pos              _U_(8)                                               /**< (MPDDRC_DLL_SSL) SLAVEx Delay Counter Value Position */
#define MPDDRC_DLL_SSL_SDCNT_Msk              (_U_(0xFF) << MPDDRC_DLL_SSL_SDCNT_Pos)              /**< (MPDDRC_DLL_SSL) SLAVEx Delay Counter Value Mask */
#define MPDDRC_DLL_SSL_SDCNT(value)           (MPDDRC_DLL_SSL_SDCNT_Msk & ((value) << MPDDRC_DLL_SSL_SDCNT_Pos))
#define MPDDRC_DLL_SSL_SDCVAL_Pos             _U_(20)                                              /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Value Position */
#define MPDDRC_DLL_SSL_SDCVAL_Msk             (_U_(0xFF) << MPDDRC_DLL_SSL_SDCVAL_Pos)             /**< (MPDDRC_DLL_SSL) SLAVEx Delay Correction Value Mask */
#define MPDDRC_DLL_SSL_SDCVAL(value)          (MPDDRC_DLL_SSL_SDCVAL_Msk & ((value) << MPDDRC_DLL_SSL_SDCVAL_Pos))
#define MPDDRC_DLL_SSL_Msk                    _U_(0x0FF0FF07)                                      /**< (MPDDRC_DLL_SSL) Register Mask  */


