Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
/* -------- MPDDRC_DLL_SWR : (MPDDRC Offset: 0x148) ( R/ 32) MPDDRC DLL Status CLKWR 0 Register -------- */
#define MPDDRC_DLL_SWR_WRDCNT_Pos             _U_(0)                                               /**< (MPDDRC_DLL_SWR) CLKWRx Delay Counter Value Position */
#define MPDDRC_DLL_SWR_WRDCNT_Msk             (_U_(0xFF) << MPDDRC_DLL_SWR_WRDCNT_Pos)             /**< (MPDDRC_DLL_SWR) CLKWRx Delay Counter Value Mask */
#define MPDDRC_DLL_SWR_WRDCNT(value)          (MPDDRC_DLL_SWR_WRDCNT_Msk & ((value) << MPDDRC_DLL_SWR_WRDCNT_Pos))
#define MPDDRC_DLL_SWR_Msk                    _U_(0x000000FF)                                      /**< (MPDDRC_DLL_SWR) Register Mask  */


/* -------- MPDDRC_DLL_BC : (MPDDRC Offset: 0x1D0) ( /W 32) MPDDRC DLL BIST Control Register -------- */
#define MPDDRC_DLL_BC_BISTEN_Pos              _U_(0)                                               /**< (MPDDRC_DLL_BC) BIST Mode Enable Position */
#define MPDDRC_DLL_BC_BISTEN_Msk              (_U_(0x1) << MPDDRC_DLL_BC_BISTEN_Pos)               /**< (MPDDRC_DLL_BC) BIST Mode Enable Mask */
#define MPDDRC_DLL_BC_BISTEN(value)           (MPDDRC_DLL_BC_BISTEN_Msk & ((value) << MPDDRC_DLL_BC_BISTEN_Pos))
#define MPDDRC_DLL_BC_BIST2EN_Pos             _U_(1)                                               /**< (MPDDRC_DLL_BC) BIST 2 Mode Enable Position */
#define MPDDRC_DLL_BC_BIST2EN_Msk             (_U_(0x1) << MPDDRC_DLL_BC_BIST2EN_Pos)              /**< (MPDDRC_DLL_BC) BIST 2 Mode Enable Mask */
#define MPDDRC_DLL_BC_BIST2EN(value)          (MPDDRC_DLL_BC_BIST2EN_Msk & ((value) << MPDDRC_DLL_BC_BIST2EN_Pos))
#define MPDDRC_DLL_BC_Msk                     _U_(0x00000003)                                      /**< (MPDDRC_DLL_BC) Register Mask  */


/* -------- MPDDRC_DLL_BS : (MPDDRC Offset: 0x1D4) ( R/ 32) MPDDRC DLL BIST Status Register -------- */
#define MPDDRC_DLL_BS_BISTS_Pos               _U_(0)                                               /**< (MPDDRC_DLL_BS) BIST Mode Status Position */
#define MPDDRC_DLL_BS_BISTS_Msk               (_U_(0x1) << MPDDRC_DLL_BS_BISTS_Pos)                /**< (MPDDRC_DLL_BS) BIST Mode Status Mask */
#define MPDDRC_DLL_BS_BISTS(value)            (MPDDRC_DLL_BS_BISTS_Msk & ((value) << MPDDRC_DLL_BS_BISTS_Pos))
#define MPDDRC_DLL_BS_BIST2S_Pos              _U_(1)                                               /**< (MPDDRC_DLL_BS) BIST2 Mode Status Position */
#define MPDDRC_DLL_BS_BIST2S_Msk              (_U_(0x1) << MPDDRC_DLL_BS_BIST2S_Pos)               /**< (MPDDRC_DLL_BS) BIST2 Mode Status Mask */
#define MPDDRC_DLL_BS_BIST2S(value)           (MPDDRC_DLL_BS_BIST2S_Msk & ((value) << MPDDRC_DLL_BS_BIST2S_Pos))
#define MPDDRC_DLL_BS_BIST2PASS_Pos           _U_(2)                                               /**< (MPDDRC_DLL_BS) BIST 2 is pass Position */
#define MPDDRC_DLL_BS_BIST2PASS_Msk           (_U_(0x1) << MPDDRC_DLL_BS_BIST2PASS_Pos)            /**< (MPDDRC_DLL_BS) BIST 2 is pass Mask */
#define MPDDRC_DLL_BS_BIST2PASS(value)        (MPDDRC_DLL_BS_BIST2PASS_Msk & ((value) << MPDDRC_DLL_BS_BIST2PASS_Pos))
#define MPDDRC_DLL_BS_DL_BIST2_FAIL_Pos       _U_(8)                                               /**< (MPDDRC_DLL_BS) Delay line x [0:6] is failed Position */
#define MPDDRC_DLL_BS_DL_BIST2_FAIL_Msk       (_U_(0x7F) << MPDDRC_DLL_BS_DL_BIST2_FAIL_Pos)       /**< (MPDDRC_DLL_BS) Delay line x [0:6] is failed Mask */
#define MPDDRC_DLL_BS_DL_BIST2_FAIL(value)    (MPDDRC_DLL_BS_DL_BIST2_FAIL_Msk & ((value) << MPDDRC_DLL_BS_DL_BIST2_FAIL_Pos))
#define MPDDRC_DLL_BS_Msk                     _U_(0x00007F07)                                      /**< (MPDDRC_DLL_BS) Register Mask  */


/* -------- MPDDRC_DLL_REVISION : (MPDDRC Offset: 0x1FC) ( R/ 32) MPDDRC DLL Revision Register -------- */
#define MPDDRC_DLL_REVISION_VERSION_Pos       _U_(0)                                               /**< (MPDDRC_DLL_REVISION) Version of the Hardware Module Position */
#define MPDDRC_DLL_REVISION_VERSION_Msk       (_U_(0xFFF) << MPDDRC_DLL_REVISION_VERSION_Pos)      /**< (MPDDRC_DLL_REVISION) Version of the Hardware Module Mask */
#define MPDDRC_DLL_REVISION_VERSION(value)    (MPDDRC_DLL_REVISION_VERSION_Msk & ((value) << MPDDRC_DLL_REVISION_VERSION_Pos))
#define MPDDRC_DLL_REVISION_MFN_Pos           _U_(16)                                              /**< (MPDDRC_DLL_REVISION) Metal Fix Number Position */
#define MPDDRC_DLL_REVISION_MFN_Msk           (_U_(0x7) << MPDDRC_DLL_REVISION_MFN_Pos)            /**< (MPDDRC_DLL_REVISION) Metal Fix Number Mask */
#define MPDDRC_DLL_REVISION_MFN(value)        (MPDDRC_DLL_REVISION_MFN_Msk & ((value) << MPDDRC_DLL_REVISION_MFN_Pos))
#define MPDDRC_DLL_REVISION_Msk               _U_(0x00070FFF)                                      /**< (MPDDRC_DLL_REVISION) Register Mask  */


/** \brief MPDDRC register offsets definitions */
#define MPDDRC_MR_REG_OFST             (0x00)              /**< (MPDDRC_MR) Mode Register Offset */
#define MPDDRC_RTR_REG_OFST            (0x04)              /**< (MPDDRC_RTR) Refresh Timer Register Offset */
#define MPDDRC_CR_REG_OFST             (0x08)              /**< (MPDDRC_CR) Configuration Register Offset */
#define MPDDRC_TPR0_REG_OFST           (0x0C)              /**< (MPDDRC_TPR0) Timing Parameter 0 Register Offset */
#define MPDDRC_TPR1_REG_OFST           (0x10)              /**< (MPDDRC_TPR1) Timing Parameter 1 Register Offset */
#define MPDDRC_TPR2_REG_OFST           (0x14)              /**< (MPDDRC_TPR2) Timing Parameter 2 Register Offset */
#define MPDDRC_LPR_REG_OFST            (0x1C)              /**< (MPDDRC_LPR) Low-Power Register Offset */
#define MPDDRC_MD_REG_OFST             (0x20)              /**< (MPDDRC_MD) Memory Device Register Offset */
#define MPDDRC_IO_CALIBR_REG_OFST      (0x34)              /**< (MPDDRC_IO_CALIBR) I/O Calibration Register Offset */
#define MPDDRC_OCMS_REG_OFST           (0x38)              /**< (MPDDRC_OCMS) OCMS Register Offset */
#define MPDDRC_OCMS_KEY1_REG_OFST      (0x3C)              /**< (MPDDRC_OCMS_KEY1) OCMS KEY1 Register Offset */
#define MPDDRC_OCMS_KEY2_REG_OFST      (0x40)              /**< (MPDDRC_OCMS_KEY2) OCMS KEY2 Register Offset */
#define MPDDRC_CONF_ARBITER_REG_OFST   (0x44)              /**< (MPDDRC_CONF_ARBITER) Configuration Arbiter Register Offset */
#define MPDDRC_TIMEOUT_REG_OFST        (0x48)              /**< (MPDDRC_TIMEOUT) Timeout Register Offset */
#define MPDDRC_REQ_PORT_0123_REG_OFST  (0x4C)              /**< (MPDDRC_REQ_PORT_0123) Request Port 0-1-2-3 Register Offset */
#define MPDDRC_BDW_PORT_0123_REG_OFST  (0x54)              /**< (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth Port 0-1-2-3 Register Offset */
#define MPDDRC_RD_DATA_PATH_REG_OFST   (0x5C)              /**< (MPDDRC_RD_DATA_PATH) Read Data Path Register Offset */
#define MPDDRC_MCFGR_REG_OFST          (0x60)              /**< (MPDDRC_MCFGR) Monitor Configuration Register Offset */
#define MPDDRC_MADDR0_REG_OFST         (0x64)              /**< (MPDDRC_MADDR0) Monitor Address High/Low Port 0 Register Offset */
#define MPDDRC_MADDR1_REG_OFST         (0x68)              /**< (MPDDRC_MADDR1) Monitor Address High/Low Port 1 Register Offset */
#define MPDDRC_MADDR2_REG_OFST         (0x6C)              /**< (MPDDRC_MADDR2) Monitor Address High/Low Port 2 Register Offset */
#define MPDDRC_MADDR3_REG_OFST         (0x70)              /**< (MPDDRC_MADDR3) Monitor Address High/Low Port 3 Register Offset */
#define MPDDRC_MINFO0_REG_OFST         (0x84)              /**< (MPDDRC_MINFO0) Monitor Information Port 0 Register Offset */
#define MPDDRC_MINFO1_REG_OFST         (0x88)              /**< (MPDDRC_MINFO1) Monitor Information Port 1 Register Offset */
#define MPDDRC_MINFO2_REG_OFST         (0x8C)              /**< (MPDDRC_MINFO2) Monitor Information Port 2 Register Offset */
#define MPDDRC_MINFO3_REG_OFST         (0x90)              /**< (MPDDRC_MINFO3) Monitor Information Port 3 Register Offset */
#define MPDDRC_IER_REG_OFST            (0xC0)              /**< (MPDDRC_IER) Interrupt Enable Register Offset */
#define MPDDRC_IDR_REG_OFST            (0xC4)              /**< (MPDDRC_IDR) Interrupt Disable Register Offset */
#define MPDDRC_IMR_REG_OFST            (0xC8)              /**< (MPDDRC_IMR) Interrupt Mask Register Offset */
#define MPDDRC_ISR_REG_OFST            (0xCC)              /**< (MPDDRC_ISR) Interrupt Status Register Offset */
#define MPDDRC_SAFETY_REG_OFST         (0xD0)              /**< (MPDDRC_SAFETY) Safety Register Offset */
#define MPDDRC_WPMR_REG_OFST           (0xE4)              /**< (MPDDRC_WPMR) Write Protection Mode Register Offset */
#define MPDDRC_WPSR_REG_OFST           (0xE8)              /**< (MPDDRC_WPSR) Write Protection Status Register Offset */
#define MPDDRC_VERSION_REG_OFST        (0xFC)              /**< (MPDDRC_VERSION) MPDDRC Version Register Offset */
#define MPDDRC_DLL_OS_REG_OFST         (0x100)             /**< (MPDDRC_DLL_OS) MPDDRC DLL Offset Selection Register Offset */
#define MPDDRC_DLL_MAO_REG_OFST        (0x104)             /**< (MPDDRC_DLL_MAO) MPDDRC DLL Master Offset Register Offset */
#define MPDDRC_DLL_SO0_REG_OFST        (0x108)             /**< (MPDDRC_DLL_SO0) MPDDRC DLL Slave Offset 0 Register Offset */
#define MPDDRC_DLL_WRO_REG_OFST        (0x110)             /**< (MPDDRC_DLL_WRO) MPDDRC DLL CLKWR Offset Register Offset */
#define MPDDRC_DLL_SM_REG_OFST         (0x118)             /**< (MPDDRC_DLL_SM) MPDDRC DLL Status Master 0 Register Offset */
#define MPDDRC_DLL_SSL_REG_OFST        (0x128)             /**< (MPDDRC_DLL_SSL) MPDDRC DLL Status Slave 0 Register Offset */
#define MPDDRC_DLL_SWR_REG_OFST        (0x148)             /**< (MPDDRC_DLL_SWR) MPDDRC DLL Status CLKWR 0 Register Offset */
#define MPDDRC_DLL_BC_REG_OFST         (0x1D0)             /**< (MPDDRC_DLL_BC) MPDDRC DLL BIST Control Register Offset */
#define MPDDRC_DLL_BS_REG_OFST         (0x1D4)             /**< (MPDDRC_DLL_BS) MPDDRC DLL BIST Status Register Offset */
#define MPDDRC_DLL_REVISION_REG_OFST   (0x1FC)             /**< (MPDDRC_DLL_REVISION) MPDDRC DLL Revision Register Offset */

