Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/mpddrc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MPDDRC register API structure */
typedef struct
{
  __IO  uint32_t                       MPDDRC_MR;          /**< Offset: 0x00 (R/W  32) Mode Register */
  __IO  uint32_t                       MPDDRC_RTR;         /**< Offset: 0x04 (R/W  32) Refresh Timer Register */
  __IO  uint32_t                       MPDDRC_CR;          /**< Offset: 0x08 (R/W  32) Configuration Register */
  __IO  uint32_t                       MPDDRC_TPR0;        /**< Offset: 0x0C (R/W  32) Timing Parameter 0 Register */
  __IO  uint32_t                       MPDDRC_TPR1;        /**< Offset: 0x10 (R/W  32) Timing Parameter 1 Register */
  __IO  uint32_t                       MPDDRC_TPR2;        /**< Offset: 0x14 (R/W  32) Timing Parameter 2 Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       MPDDRC_LPR;         /**< Offset: 0x1C (R/W  32) Low-Power Register */
  __IO  uint32_t                       MPDDRC_MD;          /**< Offset: 0x20 (R/W  32) Memory Device Register */
  __I   uint8_t                        Reserved2[0x10];
  __IO  uint32_t                       MPDDRC_IO_CALIBR;   /**< Offset: 0x34 (R/W  32) I/O Calibration Register */
  __IO  uint32_t                       MPDDRC_OCMS;        /**< Offset: 0x38 (R/W  32) OCMS Register */
  __O   uint32_t                       MPDDRC_OCMS_KEY1;   /**< Offset: 0x3C ( /W  32) OCMS KEY1 Register */
  __O   uint32_t                       MPDDRC_OCMS_KEY2;   /**< Offset: 0x40 ( /W  32) OCMS KEY2 Register */
  __IO  uint32_t                       MPDDRC_CONF_ARBITER; /**< Offset: 0x44 (R/W  32) Configuration Arbiter Register */
  __IO  uint32_t                       MPDDRC_TIMEOUT;     /**< Offset: 0x48 (R/W  32) Timeout Register */
  __IO  uint32_t                       MPDDRC_REQ_PORT_0123; /**< Offset: 0x4C (R/W  32) Request Port 0-1-2-3 Register */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint32_t                       MPDDRC_BDW_PORT_0123; /**< Offset: 0x54 (R/   32) Current/Maximum Bandwidth Port 0-1-2-3 Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       MPDDRC_RD_DATA_PATH; /**< Offset: 0x5C (R/W  32) Read Data Path Register */
  __IO  uint32_t                       MPDDRC_MCFGR;       /**< Offset: 0x60 (R/W  32) Monitor Configuration Register */
  __IO  uint32_t                       MPDDRC_MADDR0;      /**< Offset: 0x64 (R/W  32) Monitor Address High/Low Port 0 Register */
  __IO  uint32_t                       MPDDRC_MADDR1;      /**< Offset: 0x68 (R/W  32) Monitor Address High/Low Port 1 Register */
  __IO  uint32_t                       MPDDRC_MADDR2;      /**< Offset: 0x6C (R/W  32) Monitor Address High/Low Port 2 Register */
  __IO  uint32_t                       MPDDRC_MADDR3;      /**< Offset: 0x70 (R/W  32) Monitor Address High/Low Port 3 Register */
  __I   uint8_t                        Reserved5[0x10];
  __I   uint32_t                       MPDDRC_MINFO0;      /**< Offset: 0x84 (R/   32) Monitor Information Port 0 Register */
  __I   uint32_t                       MPDDRC_MINFO1;      /**< Offset: 0x88 (R/   32) Monitor Information Port 1 Register */
  __I   uint32_t                       MPDDRC_MINFO2;      /**< Offset: 0x8C (R/   32) Monitor Information Port 2 Register */
  __I   uint32_t                       MPDDRC_MINFO3;      /**< Offset: 0x90 (R/   32) Monitor Information Port 3 Register */
  __I   uint8_t                        Reserved6[0x2C];
  __O   uint32_t                       MPDDRC_IER;         /**< Offset: 0xC0 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       MPDDRC_IDR;         /**< Offset: 0xC4 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       MPDDRC_IMR;         /**< Offset: 0xC8 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       MPDDRC_ISR;         /**< Offset: 0xCC (R/   32) Interrupt Status Register */
  __IO  uint32_t                       MPDDRC_SAFETY;      /**< Offset: 0xD0 (R/W  32) Safety Register */
  __I   uint8_t                        Reserved7[0x10];
  __IO  uint32_t                       MPDDRC_WPMR;        /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       MPDDRC_WPSR;        /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved8[0x10];
  __I   uint32_t                       MPDDRC_VERSION;     /**< Offset: 0xFC (R/   32) MPDDRC Version Register */
  __IO  uint32_t                       MPDDRC_DLL_OS;      /**< Offset: 0x100 (R/W  32) MPDDRC DLL Offset Selection Register */
  __IO  uint32_t                       MPDDRC_DLL_MAO;     /**< Offset: 0x104 (R/W  32) MPDDRC DLL Master Offset Register */
  __IO  uint32_t                       MPDDRC_DLL_SO0;     /**< Offset: 0x108 (R/W  32) MPDDRC DLL Slave Offset 0 Register */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       MPDDRC_DLL_WRO;     /**< Offset: 0x110 (R/W  32) MPDDRC DLL CLKWR Offset Register */
  __I   uint8_t                        Reserved10[0x04];
  __I   uint32_t                       MPDDRC_DLL_SM[2];   /**< Offset: 0x118 (R/   32) MPDDRC DLL Status Master 0 Register */
  __I   uint8_t                        Reserved11[0x08];
  __I   uint32_t                       MPDDRC_DLL_SSL[4];  /**< Offset: 0x128 (R/   32) MPDDRC DLL Status Slave 0 Register */
  __I   uint8_t                        Reserved12[0x10];
  __I   uint32_t                       MPDDRC_DLL_SWR[2];  /**< Offset: 0x148 (R/   32) MPDDRC DLL Status CLKWR 0 Register */
  __I   uint8_t                        Reserved13[0x80];
  __O   uint32_t                       MPDDRC_DLL_BC;      /**< Offset: 0x1D0 ( /W  32) MPDDRC DLL BIST Control Register */
  __I   uint32_t                       MPDDRC_DLL_BS;      /**< Offset: 0x1D4 (R/   32) MPDDRC DLL BIST Status Register */
  __I   uint8_t                        Reserved14[0x24];
  __I   uint32_t                       MPDDRC_DLL_REVISION; /**< Offset: 0x1FC (R/   32) MPDDRC DLL Revision Register */
} mpddrc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_MPDDRC_COMPONENT_H_ */
